; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image0 - mode
	infrared1 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument1 image0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image0)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image0)
	(supports instrument5 spectrograph2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star5)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite1 Star12)
	(pointing satellite3 GroundStation1)
	(have_image Planet7 spectrograph2)
	(have_image Planet8 image0)
	(have_image Star9 infrared1)
	(have_image Star10 infrared1)
	(have_image Planet11 spectrograph2)
	(have_image Star12 spectrograph2)
	(have_image Planet13 spectrograph2)
	(have_image Planet14 image0)
	(have_image Star15 image0)
	(have_image Planet16 spectrograph2)
	(have_image Planet17 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation2 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 13
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 13
3. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 13
4. (turn_to satellite1 planet17 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet17)
   goals met: 0 of 13
5. (take_image satellite1 planet17 instrument2 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 1 of 13
6. (turn_to satellite1 planet16 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet16)
   goals met: 1 of 13
7. (take_image satellite1 planet16 instrument2 spectrograph2)
   added: (have_image planet16 spectrograph2)
   goals met: 2 of 13
8. (turn_to satellite1 planet14 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet14)
   goals met: 2 of 13
9. (take_image satellite1 planet14 instrument2 image0)
   added: (have_image planet14 image0)
   goals met: 3 of 13
10. (turn_to satellite1 planet13 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet13)
   goals met: 3 of 13
11. (take_image satellite1 planet13 instrument2 spectrograph2)
   added: (have_image planet13 spectrograph2)
   goals met: 4 of 13
12. (turn_to satellite1 planet11 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet11)
   goals met: 4 of 13
13. (take_image satellite1 planet11 instrument2 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 5 of 13
14. (turn_to satellite1 planet7 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet7)
   goals met: 5 of 13
15. (take_image satellite1 planet7 instrument2 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 6 of 13
16. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 6 of 13
17. (take_image satellite1 planet8 instrument2 image0)
   added: (have_image planet8 image0)
   goals met: 7 of 13
18. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 7 of 13
19. (take_image satellite1 star10 instrument2 infrared1)
   added: (have_image star10 infrared1)
   goals met: 8 of 13
20. (turn_to satellite1 star15 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star15)
   goals met: 8 of 13
21. (take_image satellite1 star15 instrument2 image0)
   added: (have_image star15 image0)
   goals met: 9 of 13
22. (turn_to satellite1 star9 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star9)
   goals met: 9 of 13
23. (take_image satellite1 star9 instrument2 infrared1)
   added: (have_image star9 infrared1)
   goals met: 10 of 13
24. (turn_to satellite1 star12 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star12)
   goals met: 11 of 13
25. (take_image satellite1 star12 instrument2 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 12 of 13
26. (turn_to satellite3 groundstation1 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 groundstation1)
   goals met: 13 of 13
